Repository: CoWave-Fall/IPMI-ProgrammedFanTweaker
Catalog: 程控静扇/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# About_Title.Text
source: About
zh_cn: 关于

# AppName_Label.Text
source: Application Name: Dell Fan Controller
zh_cn: 应用名称：戴尔风扇控制器

# Author_Label.Text
source: Author: Gemini, CoWave-Fall
zh_cn: 作者：Gemini, CoWave-Fall

# FanSpeedControl_Title.Text
source: Fan Speed Control
zh_cn: 风扇速度控制

# FanSpeed_Slider.Header
source: Fan Speed (%)
zh_cn: 风扇速度 (%)

# GetStatus_Button.Content
source: Get Sensor Status
zh_cn: 获取传感器状态

# IDRAC_IP_Label.Text
source: iDRAC IP:
zh_cn: iDRAC IP地址：

# Language_Label.Text
source: Language
zh_cn: 语言

# Nav_About.Content
source: About
zh_cn: 关于

# Nav_Settings.Content
source: Settings
zh_cn: 设置

# Nav_SpeedControl.Content
source: Speed Control
zh_cn: 调速

# Password_Label.Text
source: Password:
zh_cn: 密码：

# SetAuto_Button.Content
source: Enable Automatic Control
zh_cn: 启用自动控制

# SetManual_Button.Content
source: Set Manual Speed
zh_cn: 设置手动速度

# Settings_Title.Text
source: Settings
zh_cn: 设置

# Status_Title.Text
source: Status
zh_cn: 状态

# Username_Label.Text
source: Username:
zh_cn: 用户名：

# Version_Label
source: Version {0}.{1}.{2}
zh_cn: 版本 {0}.{1}.{2}

# AppDescription.Text
source: This program is used to control the fan speed of the server managed by IPMI. The current version is applicable to Dell iDRAC
zh_cn: 本程序用于控制受IPMI管理的服务器的风扇转速。当前版本适用于Dell iDRAC

# Program_Label.Text
source: Program: Gemini, CoWave-Fall
zh_cn: 程序：Gemini, CoWave-Fall

# Art_Label.Text
source: Art: CoWave-Fall
zh_cn: 美术：CoWave-Fall

# License_Label.Text
source: This software is licensed under the GNU General Public License v3.0. In short, you are free to distribute, modify, and use this software, but any derivative works based on it must also be open-sourced under the GPLv3 license.
zh_cn: 本软件遵循 GNU General Public License v3.0 开源协议。简而言之，您可以自由地分发、修改和使用本软件，但任何基于此软件的衍生作品也必须同样使用 GPLv3 协议进行开源。

# Acknowledgements_Title.Text
source: Acknowledgements
zh_cn: 致谢

# Acknowledgements_Text.Text
source: This project would not have been possible without the work of the following projects:
zh_cn: 没有以下项目的工作，这个项目就不可能实现：

# Gemini_Text.Text
source: Special thanks to Google Gemini for the assistance in the development of this project.
zh_cn: 特别感谢Google Gemini对本项目开发提供的协助。

# AppDisplayName.Text
source: Programmed Fan Tweaker
zh_cn: 程控静扇

# InfoBar_SettingManual
source: Setting manual fan control...
zh_cn: 正在设置手动风扇控制...

# InfoBar_SettingManualSuccess
source: Successfully set fan speed to {0}%.
zh_cn: 成功将风扇速度设置为 {0}%。

# InfoBar_SettingManualFailed
source: Failed to set fan speed.
zh_cn: 设置风扇速度失败。

# InfoBar_DisableAutoFailed
source: Failed to disable automatic fan control.
zh_cn: 禁用自动风扇控制失败。

# InfoBar_EnablingAuto
source: Enabling automatic fan control...
zh_cn: 正在启用自动风扇控制...

# InfoBar_EnableAutoSuccess
source: Successfully enabled automatic fan control.
zh_cn: 成功启用自动风扇控制。

# InfoBar_EnableAutoFailed
source: Failed to enable automatic fan control.
zh_cn: 启用自动风扇控制失败。

# InfoBar_GettingStatus
source: Getting sensor status...
zh_cn: 正在获取传感器状态...

# InfoBar_GetStatusSuccess
source: Successfully retrieved sensor status.
zh_cn: 成功检索到传感器状态。

# InfoBar_GetStatusFailed
source: Failed to retrieve sensor status.
zh_cn: 检索传感器状态失败。

# LanguageChange_Title
source: Restart required
zh_cn: 需要重启

# LanguageChange_Content
source: The language change will be applied after restarting the application.
zh_cn: 语言更改将在重启应用程序后应用。

# OK_Button
source: OK
zh_cn: 确定

# SensorName_Label.Text
source: CPU Temp Sensor Name
zh_cn: CPU温度传感器名称

# HighTempThreshold_Label.Text
source: High Temp Threshold (°C)
zh_cn: 高温阈值 (°C)

# CriticalTempThreshold_Label.Text
source: Critical Temp Threshold (°C)
zh_cn: 临界温度阈值 (°C)

# HighFanMultiplier_Label.Text
source: High Fan Multiplier (%)
zh_cn: 高风扇转速倍率 (%)

# CriticalFanMultiplier_Label.Text
source: Critical Fan Multiplier (%)
zh_cn: 临界风扇转速倍率 (%)

# CooldownHighTemp_Label.Text
source: Cooldown High Temp (°C)
zh_cn: 高温冷却阈值 (°C)

# CooldownLowTemp_Label.Text
source: Cooldown Low Temp (°C)
zh_cn: 低温冷却阈值 (°C)

# CheckInterval_Label.Text
source: Check Interval (seconds)
zh_cn: 检查间隔 (秒)

# EmergencyControl_Title.Text
source: Emergency Fan Control
zh_cn: 自动风扇控制

# EmergencyControl_Toggle.OffContent
source: Disabled
zh_cn: 已禁用

# EmergencyControl_Toggle.OnContent
source: Enabled
zh_cn: 已启用

# Notification_CriticalTemp_Title
source: Critical Temperature Alert
zh_cn: 临界温度警报

# Notification_CriticalTemp_Body
source: CPU temperature has exceeded {0}°C. Fan speed set to {1}%.
zh_cn: CPU温度已超过 {0}°C。风扇速度已设置为 {1}%。

source: Communicating with iDRAC...
zh_cn: 正在与iDRAC通信...

# CpuTempSeries_Name
source: CPU Temperature
zh_cn: CPU 温度

# NoFanInfoFound
source: No fan information found
zh_cn: 未找到风扇信息

source: Fetching fan info...
zh_cn: 正在获取风扇信息...

# FetchInfoFailed
source: Failed to fetch info
zh_cn: 获取信息失败

# TempSource_Title.Text
source: CPU Temperature Source
zh_cn: CPU 温度数据来源

# TempSource_CoreTemp.Content
source: Sync from CoreTemp
zh_cn: 从CoreTemp同步

# TempSource_Sockets.Content
source: Get from Sockets
zh_cn: 从Sockets获取

# TempSource_Independent.Content
source: Independent Reading (requires administrator rights)
zh_cn: 独立读取（需要管理员权限）

# AppBehavior_Title.Text
source: Application Behavior
zh_cn: 应用程序行为

# MinimizeToTray_Toggle.Header
source: Minimize to tray
zh_cn: 最小化到托盘

# MinimizeToTray_Toggle.OffContent
source: Disabled
zh_cn: 禁用

# MinimizeToTray_Toggle.OnContent
source: Enabled
zh_cn: 启用

# RunOnStartup_Toggle.Header
source: Run on startup
zh_cn: 开机自启动

# RunOnStartup_Toggle.OffContent
source: Disabled
zh_cn: 禁用

# RunOnStartup_Toggle.OnContent
source: Enabled
zh_cn: 启用

# Save_Button.Content
source: Save and Apply
zh_cn: 保存并应用

# Theme_Title.Text
source: Theme
zh_cn: 主题

# Theme_System.Content
source: System
zh_cn: 跟随系统

# Theme_Light.Content
source: Light
zh_cn: 浅色

# Theme_Dark.Content
source: Dark
zh_cn: 深色

# AppTitle_Server.Text
source: Server
zh_cn: 服务器

# AppTitle_ThermalManager.Text
source: Thermal Manager
zh_cn: 热管理器

# AppTitle_ProgrammedFanTweaker.Text
source: ⌈ProgrammedFanTweaker⌋
zh_cn: 「程控静扇」
